#include <stdio.h>

int main() {
    int a;
    int b;
    int c;
    
    printf("Ввведіть сторону трикутника а: ");
    scanf("%d", &a);
     printf("Ввведіть сторону трикутника b: ");
    scanf("%d", &b);
     printf("Ввведіть сторону трикутника c: ");
    scanf("%d", &c);

    int a2 = a*a;
    int b2 = b*b;
    int c2 = c*c;
    
//перевірка чи існує трикутник
    if ((a+b<=c) || (b+c<=a) || (c+a<=b) || (a<=0) || (b<=0) || (c<=0)) {
        printf("Трикутника не існує");
        return 0;
//визначення за сторонами
    }
    else if ((a==b) && (b==c)) {
         printf("Трикутник рівносторонній");
         }
    else if ((a==b) || (b==c) || (a==c)) {
        printf("Трикутник рівнобедрений");
    }
    else {
        printf("Трикутник різносторонній");
    }

//визначення за кутами
    if (a2 + b2 == c2 || b2 + c2 == a2 || c2 + a2 == b2) {
        printf(" та прямокутний\n");
    } 
    else if (a2 + b2 < c2 || b2 + c2 < a2 || c2 + a2 < b2) {
        printf(" та тупокутний\n");
    } 
    else {
        printf(" та гострокутний \n");
    }
    
    return 0;
}